Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateOneOrMoreTreads Property
 Can't create geometry for one or more treads.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateOneOrMoreTreads { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateOneOrMoreTreads As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateOneOrMoreTreads {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace